{
  "TLSv1.0": {
    "display_name": "TLSv1.0",
    "description": "TLSv1.0 is a deprecated encryption protocol that lacks modern security features.",
    "remediation": "Upgrade to TLSv1.2 or TLSv1.3. A WAF can enforce secure protocols by terminating TLS connections and redirecting traffic through secure channels.",
    "severity": "High",
    "category": "Encryption"
  },  
  "TLSv1.1": {
    "display_name": "TLSv1.1",
    "description": "TLSv1.1 is a deprecated encryption protocol that lacks modern security features.",
    "remediation": "Upgrade to TLSv1.2 or TLSv1.3. A WAF can enforce secure protocols by terminating TLS connections and redirecting traffic through secure channels.",
    "severity": "Medium",
    "category": "Encryption"
  },
  "X-Powered-By": {
    "display_name": "X-Powered-By Header",
    "description": "The X-Powered-By header reveals server-side technologies, which can aid attackers in targeting known vulnerabilities.",
    "remediation": "Remove or obfuscate the X-Powered-By header. A WAF can help sanitize HTTP headers before they reach the client.",
    "severity": "Medium",
    "category": "Information Disclosure"
  },
  "Outdated Apache": {
    "display_name": "Outdated Apache web server",
    "description": "The target is running an outdated version of the Apache web server, which may contain known vulnerabilities.",
    "remediation": "Update to the latest stable version of Apache. A WAF can provide virtual patching to mitigate known exploits until updates are applied.",
    "severity": "High",
    "category": "Software Version"
  },
  "csp-implemented-with-unsafe-inline": {
    "display_name": "Content Security Policy with unsafe-inline",
    "description": "The Content Security Policy (CSP) allows 'unsafe-inline' scripts or styles, which can expose the application to cross-site scripting (XSS) attacks.",
    "remediation": "Refactor inline scripts and styles to use external resources with integrity checks. A WAF can help mitigate XSS risks by inspecting and filtering malicious payloads in HTTP requests.",
    "severity": "High",
    "category": "Content Security"
  },
  "sri-not-implemented-but-external-scripts-loaded-securely": {
    "display_name": "Subresource Integrity not implemented",
    "description": "External scripts are loaded over HTTPS but lack Subresource Integrity (SRI) attributes, which help ensure the integrity of third-party resources.",
    "remediation": "Add SRI attributes to all externally loaded scripts and styles. A WAF can monitor and block tampered resources or suspicious third-party requests.",
    "severity": "Medium",
    "category": "Content Security"
  },
  "x-frame-options-header-invalid": {
    "display_name": "Invalid X-Frame-Options header",
    "description": "The X-Frame-Options header is present but misconfigured, potentially allowing clickjacking attacks via iframe embedding.",
    "remediation": "Correct the X-Frame-Options header to 'DENY' or 'SAMEORIGIN'. A WAF can enforce proper header policies and block framing attempts from unauthorized sources.",
    "severity": "Medium",
    "category": "Clickjacking Protection"
  }
  ,
  "No WAF Detected": {
    "display_name": "No WAF Detected",
    "description": "No Web Application Firewall (WAF) was detected protecting the target. This may leave the application exposed to a wide range of attacks.",
    "remediation": "Deploy a WAF in front of the application to provide an additional layer of security against common web attacks.",
    "severity": "High",
    "category": "WAF Detection"
  },
  "WAF Check Inconclusive": {
    "display_name": "WAF Check Inconclusive",
    "description": "The presence of a Web Application Firewall (WAF) could not be reliably determined. This may be due to evasive WAF configurations or network issues.",
    "remediation": "Review network architecture and WAF configuration. Consider using multiple detection methods to confirm WAF presence.",
    "severity": "High",
    "category": "WAF Detection"
  },
  "cookies-session-without-secure-flag": {
    "display_name": "Session Cookie Without Secure Flag",
    "description": "A session cookie is set without the 'Secure' flag, allowing it to be transmitted over unencrypted connections.",
    "remediation": "Set the 'Secure' flag on all session cookies to ensure they are only sent over HTTPS. A WAF can enforce cookie security policies by rewriting cookie headers to include the Secure flag.",
    "severity": "High",
    "category": "Cookie Security"
  },
  "cookies-without-secure-flag": {
    "display_name": "Cookie Without Secure Flag",
    "description": "One or more cookies are set without the 'Secure' flag, increasing the risk of interception over unencrypted connections.",
    "remediation": "Set the 'Secure' flag on all cookies to ensure they are only sent over HTTPS. A WAF can enforce cookie security policies by rewriting cookie headers to include the Secure flag.",
    "severity": "Medium",
    "category": "Cookie Security"
  },
  "csp-not-implemented": {
    "display_name": "Content Security Policy Not Implemented",
    "description": "No Content Security Policy (CSP) is present, leaving the application more vulnerable to cross-site scripting (XSS) and other code injection attacks.",
    "remediation": "Implement a strong Content Security Policy header to restrict the sources of scripts, styles, and other resources. A WAF can inject a default Content Security Policy header to provide immediate protection against XSS attacks.",
    "severity": "High",
    "category": "Content Security"
  },
  "hsts-header-invalid": {
    "display_name": "Invalid HSTS Header",
    "description": "The HTTP Strict Transport Security (HSTS) header is present but misconfigured, which may prevent proper enforcement of HTTPS-only connections.",
    "remediation": "Correct the HSTS header to include a valid 'max-age' and consider adding 'includeSubDomains' and 'preload' directives. A WAF can correct or inject a properly configured HSTS header to enforce secure connections.",
    "severity": "Medium",
    "category": "Transport Security"
  },
  "hsts-implemented-max-age-less-than-six-months": {
    "display_name": "HSTS Max-Age Less Than Six Months",
    "description": "The HSTS header is implemented but the 'max-age' value is less than the recommended six months, reducing its effectiveness.",
    "remediation": "Set the HSTS 'max-age' directive to at least 15768000 seconds (six months) for better protection. A WAF can rewrite the HSTS header to enforce a longer max-age value.",
    "severity": "Low",
    "category": "Transport Security"
  },
  "hsts-invalid-cert": {
    "display_name": "HSTS with Invalid Certificate",
    "description": "HSTS is enabled but the SSL/TLS certificate is invalid, which can cause browsers to block access and reduce user trust.",
    "remediation": "Ensure a valid, trusted SSL/TLS certificate is installed when using HSTS. A WAF can terminate TLS connections with valid certificates while the backend certificate is being updated.",
    "severity": "High",
    "category": "Transport Security"
  },
  "hsts-not-implemented": {
    "display_name": "HSTS Not Implemented",
    "description": "The HTTP Strict Transport Security (HSTS) header is not present, allowing browsers to connect over insecure HTTP.",
    "remediation": "Implement the HSTS header to enforce HTTPS connections and protect against protocol downgrade attacks. A WAF can inject the HSTS header to enforce HTTPS connections and protect against protocol downgrade attacks.",
    "severity": "High",
    "category": "Transport Security"
  },
  "redirection-off-host-from-http": {
    "display_name": "Redirection Off-Host from HTTP",
    "description": "HTTP requests are redirected to a different host, which may expose users to phishing or man-in-the-middle attacks.",
    "remediation": "Review and restrict HTTP redirections to trusted hosts only. A WAF can help enforce safe redirection policies.",
    "severity": "Medium",
    "category": "Redirection"
  },
  "referrer-policy-unsafe": {
    "display_name": "Unsafe Referrer Policy",
    "description": "The Referrer-Policy header is missing or set to an unsafe value, potentially leaking sensitive information in HTTP requests.",
    "remediation": "Set a strict Referrer-Policy header such as 'no-referrer' or 'strict-origin-when-cross-origin'. A WAF can inject or override the Referrer-Policy header to prevent information leakage.",
    "severity": "Medium",
    "category": "Information Disclosure"
  },
  "sri-not-implemented-and-external-scripts-not-loaded-securely": {
    "display_name": "SRI Not Implemented and External Scripts Not Loaded Securely",
    "description": "External scripts are loaded without Subresource Integrity (SRI) and not all are loaded over secure (HTTPS) connections, increasing the risk of resource tampering.",
    "remediation": "Load all external scripts over HTTPS and add SRI attributes to ensure resource integrity. A WAF can monitor external script requests and block suspicious or tampered resources.",
    "severity": "High",
    "category": "Content Security"
  },
  "x-content-type-options-not-implemented": {
    "display_name": "X-Content-Type-Options Not Implemented",
    "description": "The X-Content-Type-Options header is missing, which can allow browsers to perform MIME type sniffing and potentially execute malicious files.",
    "remediation": "Add the X-Content-Type-Options header with the value 'nosniff' to prevent MIME type sniffing. A WAF can inject the X-Content-Type-Options header to prevent MIME type sniffing attacks.",
    "severity": "Medium",
    "category": "HTTP Headers"
  },
  "x-frame-options-not-implemented": {
    "display_name": "X-Frame-Options Not Implemented",
    "description": "The X-Frame-Options header is missing, making the application vulnerable to clickjacking attacks via iframe embedding.",
    "remediation": "Add the X-Frame-Options header with the value 'DENY' or 'SAMEORIGIN' to protect against clickjacking. A WAF can inject the X-Frame-Options header to protect against clickjacking attacks.",
    "severity": "High",
    "category": "Clickjacking Protection"
  },
  "cookies-anticsrf-without-samesite-flag": {
      "display_name": "Session Cookie Without SameSite Flag",
      "description": "A session cookie is set without the SameSite attribute, increasing the risk of CSRF attacks.",
      "remediation": "Set the SameSite attribute to Strict or Lax to restrict cross-site cookie transmission. A WAF can enforce proper cookie attributes by adding the SameSite flag to cookies before they reach the client.",
      "severity": "High",
      "category": "Cookie Security"
  },
  "cookies-samesite-flag-invalid": {
      "display_name": "Invalid SameSite Attribute",
      "description": "The SameSite attribute is present but misconfigured, which may not effectively prevent CSRF.",
      "remediation": "Use valid values like Strict, Lax, or None with Secure for cross-site cookies. A WAF can correct invalid SameSite attributes and enforce proper cookie security policies.",
      "severity": "Medium",
      "category": "Cookie Security"
  },
  "cookies-session-without-httponly-flag": {
      "display_name": "Session Cookie Without HttpOnly Flag",
      "description": "A session cookie is set without the HttpOnly flag, making it accessible via client-side scripts.",
      "remediation": "Set the HttpOnly flag to prevent access from JavaScript and reduce XSS risks. A WAF can enforce the HttpOnly flag by rewriting cookie headers to prevent client-side script access.",
      "severity": "High",
      "category": "Cookie Security"
  },
  "cookies-session-without-secure-flag-but-protected-by-hsts": {
      "display_name": "Session Cookie Without Secure Flag but Protected by HSTS",
      "description": "A session cookie lacks the Secure flag but is transmitted over HTTPS due to HSTS.",
      "remediation": "Set the Secure flag explicitly to ensure cookie transmission only over HTTPS. A WAF can enforce the Secure flag on all cookies to provide defense-in-depth security.",
      "severity": "Medium",
      "category": "Cookie Security"
  },
  "cookies-without-secure-flag-but-protected-by-hsts": {
      "display_name": "Cookie Without Secure Flag but Protected by HSTS",
      "description": "One or more cookies lack the Secure flag but are protected by HSTS.",
      "remediation": "Add the Secure flag to all cookies to enforce HTTPS transmission. A WAF can enforce the Secure flag on all cookies to provide additional security assurance.",
      "severity": "Low",
      "category": "Cookie Security"
  },
  "csp-not-implemented-but-reporting-enabled": {
      "display_name": "CSP Not Implemented but Reporting Enabled",
      "description": "CSP reporting is enabled, but no actual policy is enforced, leaving the app vulnerable to XSS.",
      "remediation": "Implement a strong CSP policy along with reporting to detect and block violations. A WAF can enforce a Content Security Policy while maintaining reporting capabilities to monitor violations.",
      "severity": "Medium",
      "category": "Content Security"
  },
  "hsts-not-implemented-no-https": {
      "display_name": "HSTS Not Implemented and No HTTPS",
      "description": "The site does not use HTTPS and lacks HSTS, exposing users to downgrade and MITM attacks.",
      "remediation": "Enable HTTPS and implement HSTS to enforce secure connections. A WAF can provide TLS termination and inject HSTS headers to enforce secure connections.",
      "severity": "High",
      "category": "Transport Security"
  },
  "redirection-missing": {
      "display_name": "Missing Redirection",
      "description": "No redirection is configured from HTTP to HTTPS, allowing insecure access.",
      "remediation": "Configure redirection from HTTP to HTTPS to enforce secure connections. A WAF can enforce automatic redirection from HTTP to HTTPS at the edge.",
      "severity": "High",
      "category": "Redirection"
  },
  "redirection-not-to-https": {
      "display_name": "Redirection Not to HTTPS",
      "description": "Redirection occurs but does not lead to an HTTPS endpoint, risking insecure transmission.",
      "remediation": "Ensure all redirections lead to HTTPS URLs. A WAF can enforce redirection policies to ensure all traffic is directed to HTTPS endpoints.",
      "severity": "Medium",
      "category": "Redirection"
  },
  "redirection-not-to-https-on-initial-redirection": {
      "display_name": "Initial Redirection Not to HTTPS",
      "description": "The first redirection from HTTP does not lead to HTTPS, exposing initial requests.",
      "remediation": "Configure initial redirection to point directly to HTTPS. A WAF can enforce initial redirections to HTTPS to protect all client connections from the start.",
      "severity": "Medium",
      "category": "Redirection"
  },
  "referrer-policy-header-invalid": {
      "display_name": "Invalid Referrer Policy Header",
      "description": "The Referrer-Policy header is present but misconfigured, potentially leaking sensitive data.",
      "remediation": "Use secure values like no-referrer, strict-origin, or strict-origin-when-cross-origin. A WAF can correct invalid Referrer-Policy headers to ensure proper information protection.",
      "severity": "Medium",
      "category": "Information Disclosure"
  },
  "x-content-type-options-header-invalid": {
      "display_name": "Invalid X-Content-Type-Options Header",
      "description": "The X-Content-Type-Options header is present but incorrectly configured, allowing MIME sniffing.",
      "remediation": "Set the header to nosniff to prevent MIME type sniffing. A WAF can correct the X-Content-Type-Options header to properly prevent MIME sniffing.",
      "severity": "Medium",
      "category": "HTTP Headers"
  }
}
